# Cable Size Get Cable Size Method

Source: https://www.revitapidocs.com/2026/a03be136-fec3-9b70-0e53-ad2a799dbd4b.htm

---

| Cable Size Get Cable Size Method |
| --- |

Gets the Cable Size data by given Cable Size id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static CableSize GetCableSize(
	Document document,
	ElementId cableSizeId
)
```

```
Public Shared Function GetCableSize (
	document As Document,
	cableSizeId As ElementId
) As CableSize
```

```
public:
static CableSize^ GetCableSize(
	Document^ document,
	ElementId^ cableSizeId
)
```

```
static member GetCableSize :
        document : Document *
        cableSizeId : ElementId -> CableSize
```

#### Parameters

document Document
:   The document.

cableSizeId ElementId
:   The Cable Size id.

#### Return Value

CableSize
The Cable Size data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace